      {
          "phaseID": 1,
          "title": "Warm Up",
          "description": "Brief stretches before the main set.",
          "numOfSteps": 6,
          "targetTime": 6,
          "steps": [
            {
              "stepID": 1,
              "title": "Quad + Piriformis Walk",
              "description": "Start standing then draw left foot up behind you, pulling toward your butt for a quad stretch. Release and step forward; switch legs. After 30 seconds, cradle right leg at ankle and knee, pulling up to chest. Release and step forward; switch legs. Repeat for 30 seconds.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 2,
              "title": "Hip Opener",
              "description": "From standing, bend right knee and lift knee to hip level, then rotate the knee out to 90 degrees. (Place hand over knee to stabilize and guide if needed.) Bring leg back to front; lower foot, and switch sides. Repeat for 30 seconds.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 3,
              "title": "Arm Circles",
              "description": "Stand with feet shoulder-width apart and lift arms out to shoulder height, palms down. Make small circles; after 30 seconds, switch direction. Continue for another 30 seconds.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 4,
              "title": "Frankenstein Walk",
              "description": "Start standing with feet together. Extend right leg straight out in front of you as you bring left hand to tap right toes. Lower leg and step forward; repeat on opposite side. Continue for 30 seconds.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 5,
              "title": "Leg Crossover + Scorpion",
              "description": "1) Lie faceup, legs straight and arms out. Lift right leg up and across your body, tapping foot to the floor. Return to start; repeat on other side. After 30 seconds, flip over to lie facedown and perform a Scorpion. 2) Lie facedown. Draw left leg up and cross it over your body so that left foot is nearly in line with right hip. Hold for a breath or two, then return to start. Repeat on other side and continue to alternate for 30 seconds.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 6,
              "title": "Inchworm",
              "description": "From standing, bend forward at the waist to touch toes, then walk hands out to a high plank. Hold for 2 seconds; walk feet to meet hands. Roll up to starting position. Repeat for 1 minute.",
              "numOfRepeats": 0,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0.5,
              "maxTargetTime": 1,
              "targetHR": "1",
              "recoveryDuration": 0
            }
          ]
        },
        {
          "phaseID": 2,
          "title": "Main Set",
          "description": "Getting used to the pacing and timing",
          "numOfSteps": 1,
          "targetTime": 1200,
          "steps": [
            {
              "stepID": 1,
              "title": "Run and Walk",
              "description": "Run for 1 minute, then walk for 90 seconds.",
              "numOfRepeats": 8,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 150,
              "maxTargetTime": 150,
              "targetHR": "1",
              "recoveryDuration": 90
            }
            ]
        },
        {
          "phaseID": 3,
          "title": "Cool Down",
          "description": "Ease down the body",
          "numOfSteps": 7,
          "targetTime": 0,
          "steps": [
            {
              "stepID": 1,
              "title": "Wide Toe touch",
              "description": "Stand with your feet wider than hip-width apart and arms held out to your sides. Swing right arm down and tap left toes. Return to starting position and repeat on the other side. Continue to alternate feeling a stretch along the back of both legs.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 2,
              "title": "Glute Stretch",
              "description": "Stand tall with your core engaged. Pick up right foot and cross right shin over left thigh. At the same time, hinge at hips, and bend left knee, coming into a half-squat with legs in a figure-four position.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 3,
              "title": "Standing Quad Stretch",
              "description": "Stand tall with your core engaged. Gently pick up your right foot and hold it behind you, pulling your foot close to your butt to feel a deeper quad stretch. Focus on standing straight, not leaning forward or back, and keep your core engaged so you also get a stretch across your hip flexors.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 4,
              "title": "Side Bench Stretch",
              "description": "Stand tall with feet hip-width apart and place right hand on right hip. Lift left hand overhead and lean to the right, feeling a stretch all alongside the left side of your body. Resist bouncing, rather just hold the stretch still and exhale to go deeper. Try to leave directly to the side, do not lean forward or back.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 5,
              "title": "Arm Cross Shoulder Stretch",
              "description": "Stand tall with your core engaged. Cross your left arm across your body at chest height, and use your right forearm to gently pull it to feel more of a stretch across your shoulder and back.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 6,
              "title": "Overhead Triceps Stretch",
              "description": "Stand tall with your core engaged. Lift your right hand overhead, keeping your biceps close to your ear. Bend your arm at the elbow and allow your right hand to fall behind your head, or to touch your back at the space between your shoulder blades, if flexibility allows. Use your left hand to gently push down on your right elbow for a deeper stretch. Make sure you keep your arm close to your head and do not bend your neck, just look straight ahead throughout the stretch.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            },
            {
              "stepID": 7,
              "title": "Chest-Cross Arm Swing",
              "description": "Stand tall with your core engaged. Swing both arms forward at chest height, allowing your right arm to cross under your left arm as they come across your chest. Swing both arms open, feeling a stretch across the front of your chest, then swing them forward again, allowing your left arm to cross under your right arm. Swing your arms slowly and gently鈥攖his isn鈥檛 a warm-up exercise.",
              "numOfRepeats": 30,
              "unitDistance": 0,
              "unitSpeed": 0,
              "minTargetTime": 0,
              "maxTargetTime": 0,
              "targetHR": "1",
              "recoveryDuration": 0
            }

            ]
        }
      ]
    },
 



            ]
        }
      ]
    }
